<?php
use yii\jui\Droppable;
use yii\jui\ProgressBar;
use yii\jui\Selectable;
?>
<pre>
/*
|--------------------------------------------------------------------------
| 收缩栏
|--------------------------------------------------------------------------
|
*/
</pre>
<?= \yii\jui\Accordion::widget([
    'items' => [
          [
              'header' => '新闻人物',
              'content' => '我是新闻人物！！哈哈',
          ],
          [
              'header' => '大英雄',
              'headerOptions' => ['tag' => 'h3'],
              'content' => '圈圈圆圆滴滴点点叮叮当当嘻嘻哈哈坑坑洼洼',
              'options' => ['tag' => 'div'],
          ],
      ],
      'options' => ['tag' => 'div'],
      'itemOptions' => ['tag' => 'div'],
      'headerOptions' => ['tag' => 'h3'],
      'clientOptions' => ['collapsible' => true],
]) ?>
<pre>
/*
|--------------------------------------------------------------------------
| 拖拽
|--------------------------------------------------------------------------
|
*/
</pre>
<?php \yii\jui\Draggable::begin([
    'clientOptions' => [
        'grid' => [250, 220],
    ],
]) ?>
哈哈
<?php \yii\jui\Draggable::end() ?>
<pre>
/*
|--------------------------------------------------------------------------
| 配合上面的用，拖拽到指定区域后js操作
|--------------------------------------------------------------------------
|
*/
</pre>
<?php Droppable::begin([
    'clientOptions' => ['accept' => '.special'],
]) ?>
你好
<?php Droppable::end() ?>
<pre>
/*
|--------------------------------------------------------------------------
| Loading....
|--------------------------------------------------------------------------
|
*/
</pre>
<?php ProgressBar::begin([
    'clientOptions' => ['value' => 75],
]) ?>
<div class="progress-label">Loading...</div>
<?php ProgressBar::end() ?>
<pre>
 /*
 |--------------------------------------------------------------------------
 | 选中效果
 |--------------------------------------------------------------------------
 |
 */
</pre>
<?= Selectable::widget([
        'items' => [
            'Item 1',
            [
                'content' => 'Item2',
            ],
            [
                'content' => 'Item3',
                'options' => [
                    'tag' => 'li',
                ],
            ],
    ],
    'options' => [
        'tag' => 'ul',
    ],
        'itemOptions' => [
        'tag' => 'li',
    ],
        'clientOptions' => [
        'tolerance' => 'fit',
    ],
    ]);
?>
<pre>
/*
|--------------------------------------------------------------------------
| Spinner
|--------------------------------------------------------------------------
|
*/
</pre>
<?= \yii\jui\Spinner::widget([
    'name'=>'cnt',
    'clientOptions' => ['step' => 2],
]) ?>
<pre>
/*
|--------------------------------------------------------------------------
| Tabs
|--------------------------------------------------------------------------
|
*/
</pre>
<?= \yii\jui\Tabs::widget([
    'items'=>[
        [
            'label'=>'栏目1',
            'content'=>'我是栏目1的内容'
        ],
        [
            'label'=>'栏目2',
            'content'=>'我是栏目2的内容'
        ],
        [
            'label'=>'栏目3',
            'content'=>'我是栏目3的内容'
        ]
    ],
]) ?>
